# Spacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..Spacing Property
RebarUpdateCurvesData Class See Also
---
The spacing between the bars, according to the LayoutRule.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double Spacing { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Spacing As Double
	Get
```

Visual C++
---
```text
public:
property double Spacing {
	double get ();
}
```

# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace